#TCP & HTTP

### TCP
* [TCP三次握手详解及释放连接过程](https://www.cnblogs.com/kaleidoscope/p/9701117.html)
   * 为什么建立时三次握手中最后一步需要客户端确认？
      * 为了防止已经失效的链接请求报文段突然又传回到服务器端而产生的错误场景。
   * 建立链接需要 3 次握手，断开链接需要四次挥手？ 
      * 建立时候需要保证顺序
      * 挥手：因为 TCP 是全双工，所以发送方和接受方都需要 Fin 和 Ack
* [TCP 三次握手原理，你真的理解吗？](TCP 三次握手原理，你真的理解吗？
最近，阿里中间件小哥哥蛰剑碰到一个问题——client端连接服务器总是抛)
   
### HTTPS   
* [HTTPS协议原理和流程分析](https://cloud.tencent.com/developer/article/1425339)


### HTTP2
* [HTTP2和HTTPS来不来了解一下？](https://www.jianshu.com/p/11c2614ef3f2)
   * HTTP 1.1 的改动
      * *持久链接*
      * 请求管道化
      * 增加缓存处理
      * 增加 Host 字段，支持断点传输等
   * HTTP 2 新改动
      * 二进制分帧
      * 多路复用
      * 头部压缩
      * 服务器推送
* [HTTP1.0、HTTP1.1 和 HTTP2.0 的区别](https://www.cnblogs.com/heluan/p/8620312.html)
   * HTTP 2.0 相比于 HTPP 1.x 新特性：
      * 1. 新的二进制格式
      * 2. 多路复用
      * 3. 头部压缩
         * HPAC 压缩
      * 4. 服务端推送
   * HTTP 2.0 的多路复用 VS. HTTP 1.x 的长链接
      * HTTP/1.* 一次一个请求，用完就关闭；每个请求都要建立链接
      * HTTP/1.1 Pipeline 将若干请求串行化，后面的请求要等前面的请求完成之后才能处理。存在线头阻塞的问题。
      * HTTP/2 多个请求可以在同一个连接上并行执行。某个请求任务耗时严重，不会影响其他请求的处理。
   * HTTP 2.0 的多路复用有多好？
      * HTTP 性能优化的关键不在于带宽，而在于低延时。TCP 链接会随着时间进行自我调剂，期初会限制链接最大的速度，如果数据传输成功，会随着时间推移提高传输速率。这被称为 TCP 慢启动。 HTTP 2.0 通过让所有的数据共享一个链接，可以更有效地利用 TCP 链接，让高带宽也能真正的服务于 HTTP 性能的提升。
      * [TCP慢启动，拥塞控制，ECN 笔记](https://www.cnblogs.com/edisongz/p/6986527.html)
